; domain
(define (domain imv-simple)
  (:requirements :strips :typing :negation :disjunctive-preconditions)

  (:types
    robot location item - object
  )

  (:predicates
    (at ?o - object ?l - location)
    (connected ?l1 ?l2 - location)
    (holding ?r - robot ?i - item)
    (handempty ?r - robot)
    
    (is-artifact ?i - item)
    (is-pod ?i - item)
    (inside ?a - item ?p - item)
    (empty ?p - item)
    
    (transportable ?i - item)
    (seismic-active ?l - location)
    
    (needs-cooling ?i - item)
    (cooled ?i - item)
  )

  (:action move-empty
    :parameters (?r - robot ?from ?to - location)
    :precondition (and 
        (at ?r ?from) 
        (connected ?from ?to)
        (handempty ?r)
    )
    :effect (and 
        (not (at ?r ?from)) 
        (at ?r ?to)
    )
  )

  (:action move-carrying
    :parameters (?r - robot ?from ?to - location ?i - item)
    :precondition (and 
        (at ?r ?from) 
        (connected ?from ?to)
        (holding ?r ?i)
        (transportable ?i)
        (or (not (needs-cooling ?i)) (cooled ?i))
    )
    :effect (and 
        (not (at ?r ?from)) 
        (at ?r ?to)
    )
  )

  (:action cool-down
    :parameters (?r - robot ?i - item ?l - location)
    :precondition (and 
        (at ?r ?l) 
        (holding ?r ?i) 
        (needs-cooling ?i)
        (not (cooled ?i))
    )
    :effect (cooled ?i)
  )

  (:action pick-up
    :parameters (?r - robot ?i - item ?l - location)
    :precondition (and 
        (at ?r ?l) 
        (at ?i ?l) 
        (handempty ?r)
        (not (seismic-active ?l))
    )
    :effect (and (not (at ?i ?l)) (not (handempty ?r)) (holding ?r ?i))
  )

  (:action drop
    :parameters (?r - robot ?i - item ?l - location)
    :precondition (and (at ?r ?l) (holding ?r ?i))
    :effect (and (at ?i ?l) (handempty ?r) (not (holding ?r ?i)))
  )

  (:action load-pod
    :parameters (?r - robot ?a - item ?p - item ?l - location)
    :precondition (and 
        (at ?r ?l) (at ?p ?l) (holding ?r ?a) (empty ?p)
        (is-artifact ?a) (is-pod ?p)
        (not (seismic-active ?l))
    )
    :effect (and 
        (not (holding ?r ?a)) (handempty ?r)
        (not (empty ?p)) (inside ?a ?p)
    )
  )

  (:action unload-pod
    :parameters (?r - robot ?a - item ?p - item ?l - location)
    :precondition (and 
        (at ?r ?l) (at ?p ?l) 
        (inside ?a ?p)
        (not (seismic-active ?l))
        (handempty ?r)
    )
    :effect (and 
        (holding ?r ?a) (not (handempty ?r))
        (empty ?p) (not (inside ?a ?p))
    )
  )
)

; problem
(define (problem imv-problem-1)
  (:domain imv-simple)

  (:objects
    curator - robot
    entrance tunnel hall_a hall_b cryo stasis pods_room - location
    art_alpha art_beta mars_core - item
    pod1 pod2 - item
  )

  (:init
    ;; --- TOPOLOGIA ---
    (connected entrance tunnel) (connected tunnel entrance)
    (connected tunnel hall_a)   (connected hall_a tunnel)
    (connected tunnel hall_b)   (connected hall_b tunnel)
    (connected tunnel cryo)     (connected cryo tunnel)
    (connected tunnel stasis)   (connected stasis tunnel)
    (connected tunnel pods_room)(connected pods_room tunnel)

    ;; --- STATO INIZIALE AGENTE ---
    (at curator entrance)
    (handempty curator)

    ;; --- POSIZIONAMENTO OGGETTI ---
    (at art_alpha hall_a) (is-artifact art_alpha)
    (at art_beta hall_b)  (is-artifact art_beta)
    (at mars_core cryo)   (is-artifact mars_core)

    (at pod1 pods_room) (is-pod pod1) (empty pod1)
    (at pod2 pods_room) (is-pod pod2) (empty pod2)

    ;; --- REGOLE DI TRASPORTABILITÀ ---
    (transportable pod1)
    (transportable pod2)
    (transportable art_alpha)
    (transportable mars_core)
    ;; NOTA: art_beta NON è transportable (simula la fragilità)
    ;; Questo significa che il robot non può uscire dalla stanza con art_beta in mano.

    ;; --- STATO SISMICO ---
    ;; (Nessun terremoto attivo al momento)
  )

  (:goal
    (and
      ;; 1. ARTEFATTO BETA: Deve essere "a terra" allo Stasis Lab
      ;; Questo implica implicitamente: Load -> Transport -> Unload -> Drop
      (at art_beta stasis)

      ;; 2. POD: Deve essere riportato alla base
      (at pod1 pods_room)
      (at pod2 pods_room)

      ;; 3. ALTRI OBIETTIVI (Standard)
      (at art_alpha cryo)
      (at mars_core stasis)
    )
  )
)

; plan
1. (move-empty curator entrance tunnel)
   deleted: (at curator entrance)
   added: (at curator tunnel)
   goals met: 2 of 5
2. (move-empty curator tunnel hall_a)
   deleted: (at curator tunnel)
   added: (at curator hall_a)
   goals met: 2 of 5
3. (pick-up curator art_alpha hall_a)
   deleted: (at art_alpha hall_a) (handempty curator)
   added: (holding curator art_alpha)
   goals met: 2 of 5
4. (move-carrying curator hall_a tunnel art_alpha)
   deleted: (at curator hall_a)
   added: (at curator tunnel)
   goals met: 2 of 5
5. (move-carrying curator tunnel cryo art_alpha)
   deleted: (at curator tunnel)
   added: (at curator cryo)
   goals met: 2 of 5
6. (drop curator art_alpha cryo)
   deleted: (holding curator art_alpha)
   added: (at art_alpha cryo) (handempty curator)
   goals met: 3 of 5
7. (pick-up curator mars_core cryo)
   deleted: (at mars_core cryo) (handempty curator)
   added: (holding curator mars_core)
   goals met: 3 of 5
8. (move-carrying curator cryo tunnel mars_core)
   deleted: (at curator cryo)
   added: (at curator tunnel)
   goals met: 3 of 5
9. (move-carrying curator tunnel stasis mars_core)
   deleted: (at curator tunnel)
   added: (at curator stasis)
   goals met: 3 of 5
10. (drop curator mars_core stasis)
   deleted: (holding curator mars_core)
   added: (at mars_core stasis) (handempty curator)
   goals met: 4 of 5
11. (move-empty curator stasis tunnel)
   deleted: (at curator stasis)
   added: (at curator tunnel)
   goals met: 4 of 5
12. (move-empty curator tunnel pods_room)
   deleted: (at curator tunnel)
   added: (at curator pods_room)
   goals met: 4 of 5
13. (pick-up curator pod1 pods_room)
   deleted: (at pod1 pods_room) (handempty curator)
   added: (holding curator pod1)
   goals met: 3 of 5
14. (move-carrying curator pods_room tunnel pod1)
   deleted: (at curator pods_room)
   added: (at curator tunnel)
   goals met: 3 of 5
15. (move-carrying curator tunnel hall_b pod1)
   deleted: (at curator tunnel)
   added: (at curator hall_b)
   goals met: 3 of 5
16. (drop curator pod1 hall_b)
   deleted: (holding curator pod1)
   added: (at pod1 hall_b) (handempty curator)
   goals met: 3 of 5
17. (pick-up curator art_beta hall_b)
   deleted: (at art_beta hall_b) (handempty curator)
   added: (holding curator art_beta)
   goals met: 3 of 5
18. (load-pod curator art_beta pod1 hall_b)
   deleted: (holding curator art_beta) (empty pod1)
   added: (handempty curator) (inside art_beta pod1)
   goals met: 3 of 5
19. (pick-up curator pod1 hall_b)
   deleted: (at pod1 hall_b) (handempty curator)
   added: (holding curator pod1)
   goals met: 3 of 5
20. (move-carrying curator hall_b tunnel pod1)
   deleted: (at curator hall_b)
   added: (at curator tunnel)
   goals met: 3 of 5
21. (move-carrying curator tunnel stasis pod1)
   deleted: (at curator tunnel)
   added: (at curator stasis)
   goals met: 3 of 5
22. (drop curator pod1 stasis)
   deleted: (holding curator pod1)
   added: (at pod1 stasis) (handempty curator)
   goals met: 3 of 5
23. (unload-pod curator art_beta pod1 stasis)
   deleted: (handempty curator) (inside art_beta pod1)
   added: (holding curator art_beta) (empty pod1)
   goals met: 3 of 5
24. (drop curator art_beta stasis)
   deleted: (holding curator art_beta)
   added: (at art_beta stasis) (handempty curator)
   goals met: 4 of 5
25. (pick-up curator pod1 stasis)
   deleted: (at pod1 stasis) (handempty curator)
   added: (holding curator pod1)
   goals met: 4 of 5
26. (move-carrying curator stasis tunnel pod1)
   deleted: (at curator stasis)
   added: (at curator tunnel)
   goals met: 4 of 5
27. (move-carrying curator tunnel pods_room pod1)
   deleted: (at curator tunnel)
   added: (at curator pods_room)
   goals met: 4 of 5
28. (drop curator pod1 pods_room)
   deleted: (holding curator pod1)
   added: (at pod1 pods_room) (handempty curator)
   goals met: 5 of 5
